# Pandas Practice with Fast Food Data
Author: JAAR

Date: 07/22/2025

In [3]:
# imports
import pandas as pd

In [1]:
# Load the fast food data

Get the shape and basic information for the dataset

(50, 7)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 7 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   Fast-Food Chains                                  50 non-null     object
 1   U.S. Systemwide Sales (Millions - U.S Dollars)    50 non-null     int64
 2   Average Sales per Unit (Thousands - U.S Dollars)  50 non-null     int64
 3   Franchised Stores                                 50 non-null     int64
 4   Company Stores                                    50 non-null     int64
 5   2021 Total Units                                  50 non-null     int64
 6   Total Change in Units from 2020                   50 non-null     int64
dtypes: int64(6), object(1)
memory usage: 2.9+ KB

What are the data types?

Fast-Food Chains                                    object
U.S. Systemwide Sales (Millions - U.S Dollars)       int64
Average Sales per Unit (Thousands - U.S Dollars)     int64
Franchised Stores                                    int64
Company Stores                                       int64
2021 Total Units                                     int64
Total Change in Units from 2020                      int64
dtype: object

Are there any null values?

np.int64(0)

Replace all of the columns spaces with underscores

For the series containing the fast food chains, change it to just chain

Get a sample of five entries

,chain,U.S._Systemwide_Sales_(Millions_-_U.S_Dollars),Average_Sales_per_Unit_(Thousands_-_U.S_Dollars),Franchised_Stores,Company_Stores,2021_Total_Units,Total_Change_in_Units_from_2020
37,Raising Cane’s,2377,4893,23,544,567,58
23,KFC,5100,1408,3906,47,3953,10
36,QDOBA,835,1006,406,333,739,2
17,Freddy’s Frozen Custard & Steakburgers,759,1842,391,29,420,32
5,Checkers/Rally’s,931,1145,568,266,834,-13

Rename 'Franchised Stores' as'stores_franchised' and 'Company Stores' as 'company_stores'

Order the companies by number of franchises descending and ascending by names

,U.S._Systemwide_Sales_(Millions_-_U.S_Dollars),Average_Sales_per_Unit_(Thousands_-_U.S_Dollars),franchised,company_stores,2021_Total_Units,Total_Change_in_Units_from_2020
chain,,,,,,
Subway,9350,438,21147,0,21147,-1043
McDonald’s,45960,3420,12775,663,13438,244
Dunkin',10416,1127,9244,0,9244,161
Burger King,10033,1470,7054,51,7105,24
Taco Bell,12600,1823,6540,462,7002,203

Retrieve the first three columns

,U.S._Systemwide_Sales_(Millions_-_U.S_Dollars),Average_Sales_per_Unit_(Thousands_-_U.S_Dollars),franchised
chain,,,
Arby’s,4462,1309,2293
Baskin-Robbins,686,296,2317
Bojangles,1485,1924,496
Burger King,10033,1470,7054
Carl’s Jr.,1560,1400,1011

Get every other row

,U.S._Systemwide_Sales_(Millions_-_U.S_Dollars),Average_Sales_per_Unit_(Thousands_-_U.S_Dollars),franchised,company_stores,2021_Total_Units,Total_Change_in_Units_from_2020
chain,,,,,,
Arby’s,4462,1309,2293,1116,3409,40
Bojangles,1485,1924,496,277,773,15
Carl’s Jr.,1560,1400,1011,47,1058,-21
Chick-fil-A,16700,6100,2650,82,2732,155
Church’s Chicken,776,870,731,161,892,-13

What companies have 2616, 831, and 2293 stores franchised?

,U.S._Systemwide_Sales_(Millions_-_U.S_Dollars),Average_Sales_per_Unit_(Thousands_-_U.S_Dollars),franchised,company_stores,2021_Total_Units,Total_Change_in_Units_from_2020
chain,,,,,,
Arby’s,4462,1309,2293,1116,3409,40
Culver’s,2489,3099,831,6,837,55
Jimmy John’s,2301,866,2616,41,2657,48

Assign the chain column as the index column

Which company has the most franchised stores?

'Subway'

Which company has the highest percentage of franchised stores?

chain
Baskin-Robbins    1.000000
Dunkin'           1.000000
Subway            1.000000
Tim Hortons       1.000000
Dairy Queen       0.999539
dtype: float64

Of the companies with 100% franchising, which has the most stores?

chain
Baskin-Robbins     2317
Dunkin'            9244
Subway            21147
Tim Hortons         637
Name: franchised, dtype: int64

Rename the 2021 units column to store_count, 2020 unit change column to store_count_change, us sustemwide sales to sales_in_millions and average sales per unit to store_sales_thousands

Create a column that has bool that reflects positive changes in store counts as True and negative as False

Get both the first and last chains?

,U.S._Systemwide_Sales_(Millions_-_U.S_Dollars),Average_Sales_per_Unit_(Thousands_-_U.S_Dollars),franchised,company_stores,store_count,store_count_change,positive_store_count
chain,,,,,,,
Arby’s,4462,1309,2293,1116,3409,40,True
Zaxby’s,2233,2484,761,147,908,3,True

Drop the Total Changes column and store this as a new df

Create a new column called positive growth where chains that opened stores have a 1 and chains that don't have a 0

Convert systemwide sales to thousands and store the value as a new column then drop the old column

Sort chains by sales per store descending and name ascending

,store_sales_thousands,franchised,company_stores,store_count,store_count_change,positive_store_count,positive_growth,sales_in_thousands
chain,,,,,,,,
Chick-fil-A,6100,2650,82,2732,155,True,1,16700000
Raising Cane’s,4893,23,544,567,58,True,1,2377000
Krispy Kreme,4000,51,307,358,6,True,1,996000
Shake Shack,3679,25,218,243,38,True,1,777000
Whataburger,3640,131,742,873,29,True,1,3089000

Create a series that truncates the store count. Round store count to 5000 and 500 respectively for companies with more and less than those values

chain
Sonic Drive-In           3552
Wingstop                 1534
Burger King              5000
Bojangles                 773
Little Caesars           4181
Dairy Queen              4339
Moe’s Southwest Grill     659
Marco’s Pizza            1002
Shake Shack               500
Carl’s Jr.               1058
Name: store_count, dtype: int64

Get all the companies with sales above the mean sales

,store_sales_thousands,franchised,company_stores,store_count,store_count_change,positive_store_count,positive_growth,sales_in_thousands
chain,,,,,,,,
Arby’s,1309,2293,1116,3409,40,True,1,4462000
Baskin-Robbins,296,2317,0,2317,102,True,1,686000
Bojangles,1924,496,277,773,15,True,1,1485000
Carl’s Jr.,1400,1011,47,1058,-21,True,1,1560000
Checkers/Rally’s,1145,568,266,834,-13,True,1,931000

Create a list of chains that have over 80% franchised and over 80% company owned then sort by Revenue

,store_sales_thousands,franchised,company_stores,store_count,store_count_change,positive_store_count,positive_growth,sales_in_thousands
chain,,,,,,,,
Starbucks,1200,6497,8953,15450,113,True,1,24300000
Panera Bread,2700,1130,950,2080,-25,True,1,5650000
Arby’s,1309,2293,1116,3409,40,True,1,4462000
Five Guys,3172,911,479,1390,8,True,1,2093000
Bojangles,1924,496,277,773,15,True,1,1485000
El Pollo Loco,2000,292,189,481,1,True,1,973000
Checkers/Rally’s,1145,568,266,834,-13,True,1,931000
Del Taco,1551,306,294,600,4,True,1,931000
QDOBA,1006,406,333,739,2,True,1,835000

Have a few like this to really get it down

In [ ]:
# Try your code here
a_s=(df.Genre=='Action')|(df.Genre=='Sports')
ps2_action_sports_df = df[(a_s)&(df.Platform=='PS2')&(df.Global_Sales.between(5.0, 30.0))]

In [ ]:
# df['artist_count']=(df['artists'].str.count(',').fillna(-1).astype(int) + 1)

In [ ]:
# df.dropna().drop([...]).rename([...]).sort_values().head() CHAINING EXAMPLE
# df.drop(df.loc[df["Revenue"] < 80_000].index).sort_values(by='Revenue')
# df.drop(df.loc[df.Revenue < df.Revenue.mean()].index)
# df_usa_only = df.drop(df.loc[(~df['Is American?'])].index) is the same as df.loc[df['Is America']]
# removing columns by dropping them and then also renaming columns are things worth looking into

# datetime accessor with at .dt.year .dt.month

In [ ]:
# Find a way to mirror this?

# df_usa_software_high_efficiency = df.loc[
#     (df.Sector == 'Software Services') &
#     (df['Revenue per Employee'].mean() < df['Revenue per Employee']) &
#     (df.Country == 'USA')
# ]


# df.query("Sector == 'Consumer Electronics' and not (Country == 'USA')")

# df['artist_count']=(df['artists'].str.count(',').fillna(-1).astype(int) + 1)

In [ ]:
# df.dropna().drop([...]).rename([...]).sort_values().head() CHAINING EXAMPLE
# df.drop(df.loc[df["Revenue"] < 80_000].index).sort_values(by='Revenue')
# df.drop(df.loc[df.Revenue < df.Revenue.mean()].index)
# df_usa_only = df.drop(df.loc[(~df['Is American?'])].index) is the same as df.loc[df['Is America']]
# removing columns by dropping them and then also renaming columns are things worth looking into

# datetime accessor with at .dt.year .dt.month
# round(((df['Episode_Length(In min)'] >= 30).sum() / len(df) * 100), 2)

## Questions created by ChatGPT from easy to difficult
Following is a list of 30 questions produced by ChatGPT to practice my understanding of Pandas

In [ ]:
1.	Get the Series of fast-food chain names.

2.	Count the number of null values in each column.

3.	Get the Series of total U.S. sales.

4.	Find the maximum sales value.

In [ ]:
5.	Find the chain with the minimum number of units.
6.	Get a Series showing whether each chain is American.
7.	Count how many are American.
8.	Count how many are not American.
9.	Get a boolean Series: Is sales > 5000 million?
10.	Find the average number of total units.
11.	Get all chain names with sales over $5B (as Series).
12.	Sort the Series of total units in descending order.
13.	Create a Series of lowercase chain names.
14.	Get chains that are not American.
15.	Create a Series showing sales per unit.
16.	Check which chains have "Pizza" in their name.
17.	Get the 5 smallest chains by unit count.
18.	Rename the column "U.S. Systemwide Sales (Millions)" to lowercase using .rename().
19.	Find the chain with the second highest sales.
20.	Create a Series: is chain name longer than 10 characters?
21.	Create a Series showing sales rank (1 = highest).
22.	Get the average sales for non-American chains.
23.	Create a Series of chain names sorted by sales per unit.
24.	Count how many chains contain "Burger" or "Chicken" in the name.
25.	Normalize the sales column (0–1 range).
26.	Create a Series flagging "Global Giants" (sales > 5000 & total units > 10000).
27.	Create a Series of first letters of chain names.
28.	Replace all spaces in chain names with underscores.
29.	Bucket sales into categories: Low (<1000), Medium (1000–5000), High (>5000)
30.	Get a Series of boolean values: does chain name start with "M"?